Revit 2024 API
CorrectionFactorSet Members
The CorrectionFactorSet type exposes the following members.
Constructors
Name | Description
CorrectionFactorSet
Initializes a new instance of the CorrectionFactorSet class
Methods
Name | Description
Clear
Removes every correction factor from the set, rendering it empty.
Contains
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of correction factors that are in the set.
See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace